import { FRONTEND_CONFIG } from '@/config/frontend.config';

const isDev = !FRONTEND_CONFIG.isProd && FRONTEND_CONFIG.mode !== 'test';

export const logger = {
  log: (...args) => {
    if (isDev) console.log('[LOG]:', ...args);
  },
  info: (...args) => {
    if (isDev) console.info('[INFO]:', ...args);
  },
  warn: (...args) => {
    if (isDev) console.warn('[WARN]:', ...args);
  },
  error: (...args) => {
    // We always want errors in the console for production debugging
    console.error('[ERROR]:', ...args);

    // If you ever add Sentry/LogRocket, you'd trigger it here:
    // if (!isDev) { reportToExternalService(args); }
  },
  initArt: () => {
    console.log(`

                                     █
  █ █                      █ █      ████
█  ████ █ █           ██  ████    █████   ██
████████████          ██  ███     ███   ███
  ██████████          ██ ███     ███  ██████
    ██████████        ██ ███  ████   █████
      ██████████     █████████████████
        ███████████  ███████████████
             ████████████████
               ████████████
                 █████████
                   ███████
                    ████
     ██             ████
     ███            ████
   ███████     ███ █████  ██
     ██████     ███████████
      ██████████████████████     █
       ██████████████████████████████
         █████████████████████████████
             ███     ████████████████
              ██    ██████  ██████
              ██     ██████  ██████
               ██    █████      █████
               ████  █████         ███
                ███   ███           ██
                 ██  ████           ███
                     ███            ████
                    ████             ███
                    ████             ███
                    ███


                                             `);
  },
};
